/**
 * @Description:caoshijie
 * @Date: 2021/12/30
 * @Description: 规则文本
 * @FilePath:src\pages\1000376745\99\2201100037674501\components\ruleText.vue
*/
<template>
  <div class='box'>{{ ruleText }}</div>
</template>
<script lang='ts' setup>
import { inject } from 'vue';

const ruleText = inject('ruleText');

// const ruleText = '1.活动礼品：小棕瓶精华1.5ml*2+樱花微精华露1.5ml+DW粉底液1ml</br>2.活动时间：2021年11月01日00:00:00-2021年11月30日23:59:59</br>3.参与条件：雅诗兰黛京东自营官方旗舰店会员</br>1）雅诗兰黛品牌会员，并在本店曾下单购买正装商品且确认收货（不包括收货后退货的正装商品订单）<br>2）符合以上条件的用户在活动页成功申领礼品后（以申领页面显示结果为准），加购店铺内符合条件的正装商品，并在购物车手动勾选礼品，成功付款正装商品后，礼品将随所购商品一起发货，礼品不单独发货（若用户未在购物车勾选礼品，后续则不予补发）</br>3）申领成功后请及时下单店铺正装商品并付款，逾期则视为放弃礼品。同一京东ID用户仅能成功申领一份本活动礼品，微信号、QQ、京东帐号、手机号码、收货地址等任一信息一致或指向同一用户的，视为同一个用户</br>4.活动礼品限量50000份，数量有限，先到先得（以申领页面及购物车显示结果为准），礼品发放完毕后活动结束</br>5.凡以不正当手段（如作弊领取、恶意套取、刷信誉、虚假交易、扰乱系统、实施网络攻击等）参与本次活动的用户，商家有权终止其参与活动，并取消其获奖资格（如奖品已发放，商家有权追回），如给商家造成损失的，商家将保留向违规用户继续追索的权利</br>6.雅诗兰黛京东自营旗舰店对本次活动在法律允许范围内对本次活动规则及未尽事宜拥有解释权';
</script>
<style lang='scss' scoped>
.box {
  font-size: 0.24rem;
  white-space: pre-wrap;
}
</style>
