const simpleRule = '1 参与人群：\n'
  + '自2020年2月6日开始，首次成为品牌会员后，没有购买过正装商品并确认收货的用户（尝鲜盒/入会礼等试用装不计入在正装产品内，下单后退货用户不可参与）。\n'
  + '\n2 领取时间\n'
  + '权益领取：即日起-2022年1月31日18:00\n'
  + '礼赠随单：2021年12月31日20:00-2022年1月31日23:59\n'
  + '\n3 领取条件：符合以上条件的用户需注册会员，在购物车同时勾选领取2个产品（若只勾选1个产品，未勾选礼赠不予补发），单个ID仅可享受1份首购礼赠。';

const complexRule = '1 参与人群\n'
  + '   自2020年2月6日开始，首次在兰蔻京东自营官方旗舰店成为品牌会员后，没有购买过正装商品并确认收货的用户（尝鲜盒/入会礼等试用装不计入在正装产品内，下单后退货用户不可参与）。\n'
  + '\n2 领取时间\n'
  + '  权益领取：即日起-2022年1月31日18:00\n'
  + '  <b>礼赠随单：2021年12月31日20:00-2022年1月31日23:59</b>\n'
  + '\n3 活动礼品\n'
  + '  兰蔻眼部肌底精华液 5ml*1+兰蔻净澈焕肤双重精华水 10ml*1（产品价值222元，限量6W份，领完即止）\n'
  + '\n4 领取条件\n'
  + '   符合以上条件的用户需注册会员，<b>在购物车同时勾选领取2个产品（若只勾选1个产品，未勾选礼赠不予补发）</b>，单个ID仅可享受1份首购礼赠。\n'
  + '\n5  领取方式\n'
  + '   ①在活动页成功申领礼品后（以申领页面显示结果为准），跳转购物车页面；\n'
  + '   ②勾选待购买的正装产品并点击“换促销”或者“重新领取”赠品；\n'
  + '   ③成功付款正装产品后，礼品将随正装订单发出。\n'
  + '\n6 注意事项\n'
  + '申领成功后，请及时下单店铺正装商品并勾选礼赠付款，逾期下单或因礼赠领完缺货无法下单付款则视为放弃礼品。本活动礼品，微信号、QQ、京东帐号、手机号码、收货地址相同的视为同一用户，符合条件的只能领取一份，超出部分不发货。';

const noSatisfyRUle = '①您已经购买过正装产品，无法再次参与首购礼赠；\n'
  + '②您首次购买正装产品后，存在退货退款行为。';

export default {
  simpleRule, complexRule, noSatisfyRUle,
};
