const simpleRule = '1 参与人群：\n'
  + '首次在兰蔻京东自营官方旗舰店加入品牌会员后，\n'
  + '①2021自然年内仅成功购买过1笔正装商品订单且确认收货，2022自然年内任意购买正装产品可享受礼赠；\n'
  + '②2022自然年内仅成功购买过1笔正装商品订单，且第1笔订单发货10天后，任意购买正装产品可享受礼赠。\n'
  + '（尝鲜盒/入会礼等试用装不计入在正装产品内）\n'
  + '\n2 领取时间\n'
  + '权益领取：即日起-2022年1月31日18:00\n'
  + '礼赠随单：2021年12月31日20:00-2022年1月31日23:59\n'
  + '\n3 领取条件：符合以上条件的用户需注册会员，即可在购物车勾选领取1份礼赠（未及时勾选礼赠下单不予补发)，单个ID仅可享受1次二回礼礼赠，不可叠享。';

const complexRule = '1 参与人群\n'
  + '   首次在兰蔻京东自营官方旗舰店加入品牌会员后，\n'
  + '   ①2021自然年内仅成功购买过1笔正装商品订单且确认收货，2022自然年内任意购买正装产品可享受礼赠；\n'
  + '   ②2022自然年内仅成功购买过1笔正装商品订单，且第1笔订单发货10天后，任意购买正装产品可享受礼赠。\n'
  + ' （尝鲜盒/入会礼等试用装不计入在正装产品内）\n'
  + '\n2 领取时间\n'
  + '  权益领取：即日起-2022年1月31日18:00\n'
  + '  <b>礼赠随单：2021年12月31日20:00-2022年1月31日23:59</b>\n'
  + '\n3 活动礼品\n'
  + '  礼包1：兰蔻全新精华肌底液 7ml +兰蔻菁纯臻颜焕亮眼霜 3ml +兰蔻菁纯臻颜防晒隔离乳 5ml (产品价值487元，限量3000份，领完即止)-购买菁纯系列正装产品可享，菁纯口红、唇釉除外；\n'
  + '  礼包2：兰蔻全新精华肌底液 7ml +兰蔻肌底精华焕亮眼霜 3ml (发光眼霜3ml) +兰蔻眼部肌底精华液 5ml (产品价值453元，限量5000份，领完即止)-购买非菁纯类正装产品+菁纯口红、唇釉可享；\n'
  + '\n4 领取条件\n'
  + '   符合以上条件的用户需注册会员，<b>即可在购物车勾选领取礼赠（未及时勾选礼赠下单不予补发)</b>，单个ID仅可享受1次二回礼礼赠。\n'
  + '\n5  领取方式\n'
  + '   ①在活动页成功申领礼品后（以申领页面显示结果为准），跳转购物车页面；\n'
  + '   ②勾选待购买的正装产品并点击“换促销”或者“重新领取”赠品，2类礼赠只能领取1份，不可叠享；\n'
  + '   ③成功付款正装产品后，礼品将随正装订单发出。\n'
  + '\n6 注意事项\n'
  + '申领成功后，请及时下单店铺正装商品并勾选礼赠付款，逾期下单或因礼赠领完缺货无法下单付款则视为放弃礼品。本活动礼品，微信号、QQ、京东帐号、手机号码、收货地址相同的视为同一用户，符合条件的只能领取一份，超出部分不发货。」';

const noSatisfyRUle = '①您在2021自然年~2022自然年内，没有成功购买过正装商品（需要在入会后购买过一笔正装产品，才可参与二回礼）；\n'
  + '②您购买的第一笔订单发货未超过10天，请10天后再购买正装并领取礼赠；\n'
  + '③您购买第二笔订单存在退货行为，无法再次领取礼赠；\n'
  + '④您已经购买过2笔正装订单，无法再次参与活动。';

export default {
  simpleRule, complexRule, noSatisfyRUle,
};
